<a href="https://colab.research.google.com/github/Rakesh2711/Revoultbankexam/blob/master/Revoult_Exam.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')
import os
import pandas_profiling as pp
import seaborn as sns
# from ggplot import *
import matplotlib.pyplot as plt
from collections import Counter
import plotly.offline as py
py.init_notebook_mode(connected=True)
import plotly.graph_objs as go
import plotly.tools as tls
%matplotlib inline

In [2]:
os.getcwd()

'/content'

In [0]:
os.chdir('/content/drive/My Drive/data')

In [0]:
# # Read 4 files

device = pd.read_csv('rev-devices.csv')
notification =  pd.read_csv('rev-notifications.csv')
transaction = pd.read_csv('rev-transactions.csv')
users =  pd.read_csv('rev-users.csv')

In [5]:
device.head()

     brand    user_id
0  Android  user_3257
1    Apple  user_6809
2  Android  user_9144
3    Apple  user_3636
4  Android  user_5970

In [6]:
notification.head()

                      reason channel  ...    user_id                created_date
0  REENGAGEMENT_ACTIVE_FUNDS    PUSH  ...  user_7086  2018-12-02 17:58:33.320645
1  REENGAGEMENT_ACTIVE_FUNDS    PUSH  ...  user_6598  2018-12-01 23:09:37.367127
2  REENGAGEMENT_ACTIVE_FUNDS    PUSH  ...  user_4151  2018-12-04 02:57:56.425660
3  REENGAGEMENT_ACTIVE_FUNDS    PUSH  ...  user_1408  2018-12-11 02:04:46.284683
4  REENGAGEMENT_ACTIVE_FUNDS    PUSH  ...  user_6292  2018-12-14 17:09:58.900808

[5 rows x 5 columns]

In [7]:
transaction.head()

  transaction_id transactions_type  ...    user_id                created_date
0  transaction_0          TRANSFER  ...   user_898  2018-04-03 03:34:21.784487
1  transaction_1      CARD_PAYMENT  ...  user_1652  2019-03-19 06:15:59.537032
2  transaction_2      CARD_PAYMENT  ...  user_1652  2019-03-18 18:53:41.323032
3  transaction_3          TRANSFER  ...  user_1652  2019-03-22 14:20:01.513032
4  transaction_4      CARD_PAYMENT  ...  user_5509  2019-03-22 05:42:50.316652

[5 rows x 12 columns]

In [8]:
users.head()

  user_id  birth_year  ... num_referrals num_successful_referrals
0  user_0        1989  ...             0                        0
1  user_1        1975  ...             0                        0
2  user_2        1987  ...             0                        0
3  user_3        1994  ...             0                        0
4  user_4        1985  ...             0                        0

[5 rows x 12 columns]

In [9]:
transaction.isna().sum()

transaction_id                 0
transactions_type              0
transactions_currency          0
amount_usd                     0
transactions_state             0
ea_cardholderpresence    1170594
ea_merchant_mcc          1158658
ea_merchant_city         1158794
ea_merchant_country      1158979
direction                      0
user_id                        0
created_date                   0
dtype: int64

In [0]:
# Drpoing the columns which are having more than 40% of the data missing

for col in transaction.columns:
    if transaction[col].isna().sum()>(len(transaction)/100)*40:
        del transaction[col]

In [11]:
users.isna().sum()

user_id                                        0
birth_year                                     0
country                                        0
city                                           0
created_date                                   0
user_settings_crypto_unlocked                  0
plan                                           0
attributes_notifications_marketing_push     6610
attributes_notifications_marketing_email    6610
num_contacts                                   0
num_referrals                                  0
num_successful_referrals                       0
dtype: int64

In [12]:
# Missing value imputation for users table
users['attributes_notifications_marketing_push'].value_counts(dropna=False)/len(users)*100

1.0    62.521873
NaN    34.019557
0.0     3.458569
Name: attributes_notifications_marketing_push, dtype: float64

In [13]:
users['attributes_notifications_marketing_email'].value_counts(dropna=False)/len(users)*100

1.0    59.114771
NaN    34.019557
0.0     6.865672
Name: attributes_notifications_marketing_email, dtype: float64

In [0]:
# Here I am imputing the missing data with other catagory as 2 beacause I am trating the missing 
#catagory as other catagory

users.fillna(2,inplace=True)

# Till here we have imputed all the missing values

In [0]:
notification['created_date']=notification['created_date'].astype('datetime64[ns]')

In [0]:
transaction['created_date'] = transaction['created_date'].astype('datetime64[ns]')

In [0]:
transaction['t_month'] = transaction['created_date'].dt.month

transaction['t_year'] = transaction['created_date'].dt.year

transaction['t_day'] = transaction['created_date'].dt.day

transaction['t_week'] = transaction['created_date'].dt.week

In [18]:
transaction.head()

  transaction_id transactions_type transactions_currency  ...  t_year t_day t_week
0  transaction_0          TRANSFER                   AED  ...    2018     3     14
1  transaction_1      CARD_PAYMENT                   AED  ...    2019    19     12
2  transaction_2      CARD_PAYMENT                   AED  ...    2019    18     12
3  transaction_3          TRANSFER                   AED  ...    2019    22     12
4  transaction_4      CARD_PAYMENT                   AED  ...    2019    22     12

[5 rows x 12 columns]

In [0]:
del transaction['created_date']

In [0]:
notification['n_month'] = notification['created_date'].dt.month

notification['n_year'] = notification['created_date'].dt.year

notification['n_day'] = notification['created_date'].dt.day

notification['n_week'] = notification['created_date'].dt.week

del notification['created_date']

In [21]:
notification.head()

                      reason channel status  ... n_year  n_day  n_week
0  REENGAGEMENT_ACTIVE_FUNDS    PUSH   SENT  ...   2018      2      48
1  REENGAGEMENT_ACTIVE_FUNDS    PUSH   SENT  ...   2018      1      48
2  REENGAGEMENT_ACTIVE_FUNDS    PUSH   SENT  ...   2018      4      49
3  REENGAGEMENT_ACTIVE_FUNDS    PUSH   SENT  ...   2018     11      50
4  REENGAGEMENT_ACTIVE_FUNDS    PUSH   SENT  ...   2018     14      50

[5 rows x 8 columns]

In [0]:
users['created_date']=users['created_date'].astype('datetime64[ns]')

In [0]:
users['u_month'] = users['created_date'].dt.month

users['u_year'] = users['created_date'].dt.year

users['u_day'] = users['created_date'].dt.day

users['u_week'] = users['created_date'].dt.week

del users['created_date']

## Data PrePeration

In [24]:
list(zip([users.shape,transaction.shape,notification.shape,device.shape]))

[((19430, 15),), ((2740075, 11),), ((121813, 8),), ((19430, 2),)]

In [25]:
transaction.head(3)

  transaction_id transactions_type transactions_currency  ...  t_year t_day t_week
0  transaction_0          TRANSFER                   AED  ...    2018     3     14
1  transaction_1      CARD_PAYMENT                   AED  ...    2019    19     12
2  transaction_2      CARD_PAYMENT                   AED  ...    2019    18     12

[3 rows x 11 columns]

In [26]:
users.head(3)

  user_id  birth_year country    city  ...  u_month u_year  u_day  u_week
0  user_0        1989      PL  Gdansk  ...        1   2018     13       2
1  user_1        1975      GB  London  ...        1   2018     29       5
2  user_2        1987      PL  Poznań  ...        1   2018     18       3

[3 rows x 15 columns]

In [0]:
# pp.ProfileReport(users)

In [0]:
# attributes_notifications_marketing_email is highly correlated with attributes_notifications_marketing_push(ρ = 0.93666)
# num_contacts is highly Skewed
# num_referrals has constant value 0 
# num_successful_referrals has constant value 0 
# u_week is highly correlated with u_month (ρ = 0.98337) 
# I will drop num_referrals,num_successful_referrals,u_week from our dataset

In [0]:
# plt.rcParams['figure.figsize'] = 17,8
# sns.distplot(users['num_contacts'])
# plt.show()

In [30]:
users['num_referrals'].value_counts()

0    19430
Name: num_referrals, dtype: int64

In [31]:
users['num_successful_referrals'].value_counts()

0    19430
Name: num_successful_referrals, dtype: int64

In [0]:
users.drop(['num_referrals','num_successful_referrals','u_week'],axis=1,inplace=True)

In [33]:
users.head()

  user_id  birth_year country       city  ...  num_contacts u_month  u_year  u_day
0  user_0        1989      PL     Gdansk  ...             3       1    2018     13
1  user_1        1975      GB     London  ...            21       1    2018     29
2  user_2        1987      PL     Poznań  ...            21       1    2018     18
3  user_3        1994      FR      Paris  ...             0       1    2018     15
4  user_4        1985      GB  Beckenham  ...             2       1    2018     11

[5 rows x 12 columns]

In [34]:
device.head()

     brand    user_id
0  Android  user_3257
1    Apple  user_6809
2  Android  user_9144
3    Apple  user_3636
4  Android  user_5970

In [0]:
# sns.countplot(device['brand'])

In [36]:
notification.head()

                      reason channel status  ... n_year  n_day  n_week
0  REENGAGEMENT_ACTIVE_FUNDS    PUSH   SENT  ...   2018      2      48
1  REENGAGEMENT_ACTIVE_FUNDS    PUSH   SENT  ...   2018      1      48
2  REENGAGEMENT_ACTIVE_FUNDS    PUSH   SENT  ...   2018      4      49
3  REENGAGEMENT_ACTIVE_FUNDS    PUSH   SENT  ...   2018     11      50
4  REENGAGEMENT_ACTIVE_FUNDS    PUSH   SENT  ...   2018     14      50

[5 rows x 8 columns]

In [0]:
# pp.ProfileReport(notification)

In [0]:
# user_id has a high cardinality: 18953 distinct values Warning
# n_week is highly correlated with n_month (ρ = 0.98474) Rejected
# Dataset has 2466 duplicate rows Warning

In [0]:
notification.drop('n_week',axis = 1,inplace = True)

In [40]:
# Before dropping the duplicate rows
notification.shape

(121813, 7)

In [0]:
notification.drop_duplicates(inplace=True)

In [42]:
# After dropping the duplicate rows
notification.shape

(119347, 7)

In [0]:
# pp.ProfileReport(transaction)

In [0]:
# amount_usd has 58604 / 2.1% zeros Zeros
# amount_usd is highly skewed (γ1 = 756.51) Skewed
# user_id has a high cardinality: 18766 distinct values Warning
# t_week is highly correlated with t_month (ρ = 0.98237) Rejected

In [0]:
transaction.drop('t_week',axis=1,inplace=True)

In [45]:
transaction['amount_usd'].min()

0.0

In [0]:
# sns.distplot(np.cbrt(transaction['amount_usd']),bins=5)
# plt.xlim(0,np.cbrt(85106453190.03))
# plt.show()

 # Joining Data For Data Preperation

In [47]:
df1 = pd.merge(users,device,on=['user_id'],how='inner')

df1.head()

  user_id  birth_year country       city  ...  u_month u_year  u_day    brand
0  user_0        1989      PL     Gdansk  ...        1   2018     13    Apple
1  user_1        1975      GB     London  ...        1   2018     29    Apple
2  user_2        1987      PL     Poznań  ...        1   2018     18  Android
3  user_3        1994      FR      Paris  ...        1   2018     15    Apple
4  user_4        1985      GB  Beckenham  ...        1   2018     11    Apple

[5 rows x 13 columns]

In [48]:
df1.isna().sum()

user_id                                     0
birth_year                                  0
country                                     0
city                                        0
user_settings_crypto_unlocked               0
plan                                        0
attributes_notifications_marketing_push     0
attributes_notifications_marketing_email    0
num_contacts                                0
u_month                                     0
u_year                                      0
u_day                                       0
brand                                       0
dtype: int64

In [49]:
df2 = pd.merge(transaction,df1,on=['user_id'],how='left')

df2.head()

  transaction_id transactions_type  ... u_day    brand
0  transaction_0          TRANSFER  ...    11  Android
1  transaction_1      CARD_PAYMENT  ...     1    Apple
2  transaction_2      CARD_PAYMENT  ...     1    Apple
3  transaction_3          TRANSFER  ...     1    Apple
4  transaction_4      CARD_PAYMENT  ...    18  Android

[5 rows x 22 columns]

In [50]:
df2.isna().sum()

transaction_id                              0
transactions_type                           0
transactions_currency                       0
amount_usd                                  0
transactions_state                          0
direction                                   0
user_id                                     0
t_month                                     0
t_year                                      0
t_day                                       0
birth_year                                  0
country                                     0
city                                        0
user_settings_crypto_unlocked               0
plan                                        0
attributes_notifications_marketing_push     0
attributes_notifications_marketing_email    0
num_contacts                                0
u_month                                     0
u_year                                      0
u_day                                       0
brand                                       0
dtype: int64

In [51]:
# We can see here for one user we have lot of records for the notifications sent

notification[notification['user_id']=='user_7086']

                          reason channel  status  ... n_month  n_year  n_day
0      REENGAGEMENT_ACTIVE_FUNDS    PUSH    SENT  ...      12    2018      2
3121   REENGAGEMENT_ACTIVE_FUNDS    PUSH    SENT  ...      12    2018     27
7077   REENGAGEMENT_ACTIVE_FUNDS    PUSH    SENT  ...      12    2018     21
18761  REENGAGEMENT_ACTIVE_FUNDS    PUSH    SENT  ...       1    2019     23
20151  REENGAGEMENT_ACTIVE_FUNDS    PUSH    SENT  ...       1    2019     11
21265        FIFTH_PAYMENT_PROMO   EMAIL  FAILED  ...       1    2019     17
28851  REENGAGEMENT_ACTIVE_FUNDS    PUSH    SENT  ...      11    2018     17
33362        FIFTH_PAYMENT_PROMO    PUSH  FAILED  ...       1    2019     17
55479        FIFTH_PAYMENT_PROMO    PUSH    SENT  ...       1    2019     17
59546        FIFTH_PAYMENT_PROMO   EMAIL    SENT  ...       1    2019     17

[10 rows x 7 columns]

In [52]:
df3 = pd.merge(df2,notification,on='user_id',how='inner')

df3.head()

    transaction_id transactions_type  ... n_year  n_day
0    transaction_0          TRANSFER  ...   2018     28
1    transaction_0          TRANSFER  ...   2019     24
2  transaction_378          TRANSFER  ...   2018     28
3  transaction_378          TRANSFER  ...   2019     24
4  transaction_379               ATM  ...   2018     28

[5 rows x 28 columns]

In [53]:
df3.shape

(17984549, 28)

In [0]:
# df3.isna().sum()

In [0]:
# df3[df3['user_id']=='user_898']

In [0]:
#
df_main = df3

In [57]:
df_main.head()

    transaction_id transactions_type  ... n_year  n_day
0    transaction_0          TRANSFER  ...   2018     28
1    transaction_0          TRANSFER  ...   2019     24
2  transaction_378          TRANSFER  ...   2018     28
3  transaction_378          TRANSFER  ...   2019     24
4  transaction_379               ATM  ...   2018     28

[5 rows x 28 columns]

In [58]:
df_main.describe()

         amount_usd       t_month  ...        n_year         n_day
count  1.798455e+07  1.798455e+07  ...  1.798455e+07  1.798455e+07
mean   1.803333e+05  5.976039e+00  ...  2.018461e+03  1.615781e+01
std    9.728314e+07  3.658456e+00  ...  4.984896e-01  8.713968e+00
min    0.000000e+00  1.000000e+00  ...  2.018000e+03  1.000000e+00
25%    2.150000e+00  3.000000e+00  ...  2.018000e+03  9.000000e+00
50%    8.510000e+00  5.000000e+00  ...  2.018000e+03  1.700000e+01
75%    2.997000e+01  9.000000e+00  ...  2.019000e+03  2.400000e+01
max    8.510645e+10  1.200000e+01  ...  2.019000e+03  3.100000e+01

[8 rows x 15 columns]

In [0]:
# Changing the Datatypes of below variables to Integer as the responses are 0 or 1
df_main['attributes_notifications_marketing_push'] = df_main['attributes_notifications_marketing_push'].astype('int64')
df_main['attributes_notifications_marketing_email'] = df_main['attributes_notifications_marketing_email'].astype('int64')

In [60]:
df_main.dtypes

transaction_id                               object
transactions_type                            object
transactions_currency                        object
amount_usd                                  float64
transactions_state                           object
direction                                    object
user_id                                      object
t_month                                       int64
t_year                                        int64
t_day                                         int64
birth_year                                    int64
country                                      object
city                                         object
user_settings_crypto_unlocked                 int64
plan                                         object
attributes_notifications_marketing_push       int64
attributes_notifications_marketing_email      int64
num_contacts                                  int64
u_month                                       int64
u_year                                        int64
u_day                                         int64
brand                                        object
reason                                       object
channel                                      object
status                                       object
n_month                                       int64
n_year                                        int64
n_day                                         int64
dtype: object

# Exploratory Data Anaysis

In [61]:
df_main['user_settings_crypto_unlocked'].value_counts()

0    11698282
1     6286267
Name: user_settings_crypto_unlocked, dtype: int64

In [0]:
# plt.rcParams['figure.figsize'] = 13,6
# sns.countplot(x="transactions_type", hue="direction",data=df_main)
# plt.show()

In [0]:
# sns.countplot(x="transactions_type", hue="transactions_state",data=df_main)
# plt.show()

In [64]:
#Year Wise how many transactions 

pd.crosstab(df_main["t_year"],df_main["transactions_type"])

transactions_type     ATM  CARD_PAYMENT  CARD_REFUND  ...   TAX    TOPUP  TRANSFER
t_year                                                ...
2018               371755       5167305        38622  ...  8710  1525198   1525022
2019               254096       4436018        38546  ...  8556  1010927   1838240

[2 rows x 10 columns]

In [65]:
df_main.head()

    transaction_id transactions_type  ... n_year  n_day
0    transaction_0          TRANSFER  ...   2018     28
1    transaction_0          TRANSFER  ...   2019     24
2  transaction_378          TRANSFER  ...   2018     28
3  transaction_378          TRANSFER  ...   2019     24
4  transaction_379               ATM  ...   2018     28

[5 rows x 28 columns]

In [0]:
# df_main.groupby('brand')['transaction_id'].count()

In [0]:
# plt.rcParams['figure.figsize']= 15,8
# sns.countplot(df_main['transactions_currency'])
# plt.show()

In [68]:
who

Counter	 col	 device	 df1	 df2	 df3	 df_main	 go	 notification
np	 os	 pd	 plt	 pp	 py	 sns	 tls	 transaction
users	 warnings

In [0]:
del df1,df2,df3

In [70]:
df_main.groupby('user_id')['transaction_id'].count().reset_index()

         user_id  transaction_id
0         user_0            3112
1         user_1             903
2        user_10            6318
3       user_100             532
4      user_1000             702
...          ...             ...
18332  user_9995            4920
18333  user_9996            1440
18334  user_9997            1079
18335  user_9998               8
18336  user_9999             574

[18337 rows x 2 columns]

In [0]:
d = df_main.groupby('user_id')['transaction_id'].count().reset_index()

d.columns = ['user_id','tran_count_each_user']

df_main = pd.merge(df_main,d,on='user_id',how='left')

df_main.head()

del d

In [72]:
df_main.shape

(17984549, 29)

In [73]:
df_main['transaction_id'].nunique()

2707436

In [0]:
#  pp.ProfileReport(df_main)

In [0]:
# attributes_notifications_marketing_email is highly correlated with attributes_notifications_marketing_push (ρ = 0.92296)
df_main.drop('attributes_notifications_marketing_push',axis=1,inplace=True)

In [76]:
df_main.head(3)

    transaction_id transactions_type  ... n_day  tran_count_each_user
0    transaction_0          TRANSFER  ...    28                   522
1    transaction_0          TRANSFER  ...    24                   522
2  transaction_378          TRANSFER  ...    28                   522

[3 rows x 28 columns]

In [0]:
# Which month we have most of the Transactions
# Which month we have sent most of the notification

In [0]:
# # Monthwise user creations,user notifications ,user transactions 
# sns.set_style('dark')
# mylevels = ['u_month','n_month','t_month']
# plt.hist([df_main['u_month'],df_main['n_month'],df_main['t_month']],stacked=True,bins=12,rwidth=1,label=mylevels, color = ["skyblue",'pink','lightgreen'])
# plt.legend()
# plt.show()

In [0]:
# Per Year user creations,user notifications ,user transactions
# plt.rcParams['figure.figsize']=6,3 
# sns.set_style('dark')
# mylevels = ['u_year','n_year','t_year']
# plt.hist([df_main['u_year'],df_main['n_year'],df_main['t_year']],stacked=True,bins=2,rwidth=1,label=mylevels)
# plt.legend()
# plt.show()

# We can see we dnt have the data in 2019 which have users created

In [0]:
# # Per Day user creations,user notifications ,user transactions 
# plt.rcParams['figure.figsize']=15,8
# sns.set_style('dark')
# mylevels = ['u_day','n_day','t_day']
# plt.hist([df_main['u_day'],df_main['n_day'],df_main['t_day']],stacked=True,bins=31,rwidth=1,label=mylevels, color = ["lightpink",'orange','skyblue'])
# plt.legend()
# plt.show()

In [81]:
df_main.head()

    transaction_id transactions_type  ... n_day  tran_count_each_user
0    transaction_0          TRANSFER  ...    28                   522
1    transaction_0          TRANSFER  ...    24                   522
2  transaction_378          TRANSFER  ...    28                   522
3  transaction_378          TRANSFER  ...    24                   522
4  transaction_379               ATM  ...    28                   522

[5 rows x 28 columns]

In [82]:
# Transaction made by each user each month
d = df_main.groupby(['user_id','t_month','t_year'])['transaction_id'].count().reset_index()

d.head()

  user_id  t_month  t_year  transaction_id
0  user_0        1    2018             152
1  user_0        1    2019              56
2  user_0        2    2018             112
3  user_0        2    2019             168
4  user_0        3    2018             328

In [83]:
# Transaction made by each user each month
d1 = df_main.groupby(['user_id','u_year','u_month','t_year','t_month'])['transaction_id'].count().reset_index()

d1.head(20)

   user_id  u_year  u_month  t_year  t_month  transaction_id
0   user_0    2018        1    2018        1             152
1   user_0    2018        1    2018        2             112
2   user_0    2018        1    2018        3             328
3   user_0    2018        1    2018        4              96
4   user_0    2018        1    2018        5             144
5   user_0    2018        1    2018        6             224
6   user_0    2018        1    2018        7             376
7   user_0    2018        1    2018        8             168
8   user_0    2018        1    2018        9              40
9   user_0    2018        1    2018       10             216
10  user_0    2018        1    2018       11              96
11  user_0    2018        1    2018       12              80
12  user_0    2018        1    2019        1              56
13  user_0    2018        1    2019        2             168
14  user_0    2018        1    2019        3             136
15  user_0    2018        1    2019        4             704
16  user_0    2018        1    2019        5              16
17  user_1    2018        1    2018        1              21
18  user_1    2018        1    2018        3              63
19  user_1    2018        1    2018        4             266

In [84]:
# We can see here most of the users are created in 2018 and only 22625 were created in 2019
df_main.groupby(['u_year','u_month'])['user_id'].count()

u_year  u_month
2018    1          1939590
        2          1285802
        3          2428443
        4          1418007
        5          1802333
        6          1719792
        7          1472975
        8          1922154
        9          1316676
        10          906287
        11          805208
        12          944657
2019    1            22625
Name: user_id, dtype: int64

In [0]:
# plt.rcParams['figure.figsize'] = 9,6
# sns.countplot(df_main['u_year'])
# plt.show()

In [86]:
d2 = df_main.groupby(['user_id','u_year','u_month','t_year','t_month'])['transaction_id'].count().reset_index()

d2.head(10)

  user_id  u_year  u_month  t_year  t_month  transaction_id
0  user_0    2018        1    2018        1             152
1  user_0    2018        1    2018        2             112
2  user_0    2018        1    2018        3             328
3  user_0    2018        1    2018        4              96
4  user_0    2018        1    2018        5             144
5  user_0    2018        1    2018        6             224
6  user_0    2018        1    2018        7             376
7  user_0    2018        1    2018        8             168
8  user_0    2018        1    2018        9              40
9  user_0    2018        1    2018       10             216

In [0]:
# Define a target metric to measure user engagement. How would you define an ​engaged vs. ​unengaged​ user?

# If user was created in 2018 and he has not done much transaction in 2018 and 2019 he will treated as unengaged user if so he is engaged user.

In [88]:
# These are the users which are identified as unengaged users as there numbers of trasactions are less  than 1 transactions per month
unengaged_users = d2[d2['transaction_id']<12]

unengaged_users.head()

        user_id  u_year  u_month  t_year  t_month  transaction_id
50     user_100    2018        1    2018        5               4
53     user_100    2018        1    2018        9               8
114  user_10007    2018        8    2019        3               9
130  user_10009    2018        8    2019        5               7
133   user_1001    2018        1    2018        6               4

In [0]:
# Now I will make my Target class as Engaged or Unengaged in terms of Zero and One where Zero represents Engaged and 1 represent unengaged

In [90]:
unengaged_users.isna().sum()

user_id           0
u_year            0
u_month           0
t_year            0
t_month           0
transaction_id    0
dtype: int64

In [0]:
df_main_new = df_main.copy()

In [0]:
# [(count,userid) for (count,userid) in enumerate(unengaged_users_list)]

In [0]:
# [userid for userid in unengaged_users_list if userid in list(df_main_new['user_id'])]

In [94]:
# IF the user was created in 2018 and we have data till 2019 still if he has done total trnsacation less than 12 will be considered as unengaged
df_main_new[(df_main_new['tran_count_each_user']<=12) & (df_main_new['u_year']==2018)]

               transaction_id transactions_type  ... n_day  tran_count_each_user
411003       transaction_2283      CARD_PAYMENT  ...    27                    12
411004       transaction_2283      CARD_PAYMENT  ...    12                    12
411005       transaction_2283      CARD_PAYMENT  ...    12                    12
411006       transaction_2283      CARD_PAYMENT  ...     7                    12
411007       transaction_2283      CARD_PAYMENT  ...     1                    12
...                       ...               ...  ...   ...                   ...
17984544  transaction_2722402             TOPUP  ...     1                     3
17984545  transaction_2722402             TOPUP  ...     5                     3
17984546  transaction_2730860          TRANSFER  ...     5                     3
17984547  transaction_2730860          TRANSFER  ...     1                     3
17984548  transaction_2730860          TRANSFER  ...    12                     3

[8467 rows x 28 columns]

In [0]:
# Unengaged =1
# Engaged =0
df_main_new['engagedORUnengaged'] = np.where((df_main_new['tran_count_each_user']<=12) & (df_main_new['u_year']==2018),1 ,0)

In [96]:
df_main_new['engagedORUnengaged'].value_counts()

0    17976082
1        8467
Name: engagedORUnengaged, dtype: int64

In [0]:
# sns.countplot(df_main_new['engagedORUnengaged'])

In [0]:
# Our Dataset is Highly Skewed so that needs to be treated first 
# Our Data has catagorical variables that needs to be converted to numerical

In [99]:
df_main_new.dtypes

transaction_id                               object
transactions_type                            object
transactions_currency                        object
amount_usd                                  float64
transactions_state                           object
direction                                    object
user_id                                      object
t_month                                       int64
t_year                                        int64
t_day                                         int64
birth_year                                    int64
country                                      object
city                                         object
user_settings_crypto_unlocked                 int64
plan                                         object
attributes_notifications_marketing_email      int64
num_contacts                                  int64
u_month                                       int64
u_year                                        int64
u_day                                         int64
brand                                        object
reason                                       object
channel                                      object
status                                       object
n_month                                       int64
n_year                                        int64
n_day                                         int64
tran_count_each_user                          int64
engagedORUnengaged                            int64
dtype: object

In [100]:
df_main_new['direction'].value_counts()

OUTBOUND    14534768
INBOUND      3449781
Name: direction, dtype: int64

In [101]:
# Sepearting catagorical and numerical columns 

cat_columns = [col for col in df_main_new.select_dtypes('object') if col not in ['transaction_id','user_id','city','transactions_currency','country']]

num_columns =df_main_new.select_dtypes(['float64','int64']).columns

print(cat_columns)

print('\n')

print(num_columns)

['transactions_type', 'transactions_state', 'direction', 'plan', 'brand', 'reason', 'channel', 'status']


Index(['amount_usd', 't_month', 't_year', 't_day', 'birth_year',
       'user_settings_crypto_unlocked',
       'attributes_notifications_marketing_email', 'num_contacts', 'u_month',
       'u_year', 'u_day', 'n_month', 'n_year', 'n_day', 'tran_count_each_user',
       'engagedORUnengaged'],
      dtype='object')

In [0]:
# from sklearn.model_selection import train_test_split
# from sklearn.preprocessing import StandardScaler
# from sklearn.ensemble import RandomForestClassifier
# from sklearn.metrics import auc,roc_auc_score,accuracy_score,confusion_matrix
# from sklearn.model_selection import RandomizedSearchCV,GridSearchCV
# from sklearn.linear_model import LogisticRegression
# from imblearn.over_sampling import SMOTE

In [103]:
who

Counter	 cat_columns	 col	 d	 d1	 d2	 device	 df_main	 df_main_new
go	 notification	 np	 num_columns	 os	 pd	 plt	 pp	 py
sns	 tls	 transaction	 unengaged_users	 users	 warnings

In [0]:
del d,d1,d2,df_main,notification,transaction,users,device

In [0]:
#we have to drop the column transaction_id,user_id,city due to very high cardinality

# del df_main_new['transaction_id']
# del df_main_new['user_id']
# del df_main_new['city']

In [0]:
#Checking the correlation of each variables

# colormap = plt.cm.magma
# plt.figure(figsize=(16,12))
# plt.title('Pearson correlation of continuous features', y=1.05, size=15)
# sns.heatmap(df_main_new.corr(),linewidths=0.1,vmax=1.0, square=True, 
#             cmap=colormap, linecolor='white', annot=True)

In [107]:
df_main_new.groupby('transactions_type')['engagedORUnengaged'].mean()*100000

transactions_type
ATM              10.066294
CARD_PAYMENT      5.570988
CARD_REFUND       1.295874
CASHBACK          0.196858
EXCHANGE         19.563656
FEE             357.033441
REFUND           95.941667
TAX               0.000000
TOPUP           220.257282
TRANSFER         43.261572
Name: engagedORUnengaged, dtype: float64

In [108]:
df_main_new.columns

Index(['transaction_id', 'transactions_type', 'transactions_currency',
       'amount_usd', 'transactions_state', 'direction', 'user_id', 't_month',
       't_year', 't_day', 'birth_year', 'country', 'city',
       'user_settings_crypto_unlocked', 'plan',
       'attributes_notifications_marketing_email', 'num_contacts', 'u_month',
       'u_year', 'u_day', 'brand', 'reason', 'channel', 'status', 'n_month',
       'n_year', 'n_day', 'tran_count_each_user', 'engagedORUnengaged'],
      dtype='object')

In [109]:
df_main_new.head()

    transaction_id transactions_type  ... tran_count_each_user  engagedORUnengaged
0    transaction_0          TRANSFER  ...                  522                   0
1    transaction_0          TRANSFER  ...                  522                   0
2  transaction_378          TRANSFER  ...                  522                   0
3  transaction_378          TRANSFER  ...                  522                   0
4  transaction_379               ATM  ...                  522                   0

[5 rows x 29 columns]

In [110]:
df_main_new.groupby('status')['transaction_id'].count()

status
FAILED     4381330
SENT      13603219
Name: transaction_id, dtype: int64

In [0]:
# pp.ProfileReport(df_main_new)

In [0]:
# transaction_id has a high cardinality: 2707436 distinct values Warning
# amount_usd is highly skewed (γ1 = 744.11) Skewed
# amount_usd has 384656 / 2.1% zeros Zeros
# user_id has a high cardinality: 18337 distinct values Warning
# city has a high cardinality: 5744 distinct values Warning
# attributes_notifications_marketing_email has 1880025 / 10.5% zeros Zeros
# num_contacts has 2988128 / 16.6% zeros Zeros

In [0]:
# Will drop variables with high cardinality

# df_main_new.drop(['transaction_id','user_id','city','num_contacts'],axis=1,inplace=True)

In [114]:
df_main_new.head()

    transaction_id transactions_type  ... tran_count_each_user  engagedORUnengaged
0    transaction_0          TRANSFER  ...                  522                   0
1    transaction_0          TRANSFER  ...                  522                   0
2  transaction_378          TRANSFER  ...                  522                   0
3  transaction_378          TRANSFER  ...                  522                   0
4  transaction_379               ATM  ...                  522                   0

[5 rows x 29 columns]

In [0]:
from sklearn.model_selection import train_test_split
df_train ,df_test =train_test_split(df_main_new ,test_size =0.3 )

In [116]:
df_train.head()

              transaction_id  ... engagedORUnengaged
9866137  transaction_1056526  ...                  0
4237212   transaction_965956  ...                  0
5987532   transaction_168962  ...                  0
3745741  transaction_1256161  ...                  0
4866248  transaction_1592690  ...                  0

[5 rows x 29 columns]

In [0]:
# mf = mutual_info_classif(train_float.values,train.target.values,n_neighbors=3, random_state=17 )
# print(mf)

In [0]:
# a_dummies= pd.get_dummies(df_main_new["transactions_type"],drop_first=True)
# a_dummies.head()

In [0]:
# b_dummies= pd.get_dummies(data = df_main_new,columns = ["transactions_currency",'transactions_state','direction'],drop_first=True)
# b_dummies.head()

In [0]:
# df_main_new=pd.concat([df_main_new,b_dummies],1)

In [0]:
# df_main_new=df_main_new.drop(["transactions_currency",'transactions_state','direction'],1)

In [0]:
# c_dummies= pd.get_dummies(data = df_main_new,columns = ["transactions_type",'plan','brand','reason','channel','status'],drop_first=True)
# c_dummies.head()

In [0]:
# df_main_new=pd.concat([df_main_new,c_dummies],1)

In [0]:
# Creating dummies for n-1 combinations(Leaving refund and transfer)
 
# for i in range(len(df_main_new)):
#     if df_main_new["transactions_type"][i] in ["CASHBACK","TAX","CARD_REFUND","CARD_PAYMENT"]:
#         df_main_new.loc[i,"transactions_type"]="TT_CTCC"
#     if df_main_new["transactions_type"][i] in ["ATM","EXCHANGE"]:
#         df_main_new.loc[i,"transactions_type"]="TT_AE"
#     if df_main_new["transactions_type"][i]==["FEE",'TOPUP']:
#         df_main_new.loc[i,"transactions_type"]="TT_FT"
# ab_dummies=pd.get_dummies(df_main_new["transactions_type"])
# # ab_dummies.head()

In [0]:
# df_main_new=pd.concat([df_main_new,ab_dummies],1)
# df_main_new=df_main_new.drop(["transactions_type"],1)

In [0]:
# from sklearn.model_selection import train_test_split
# df_train ,df_test = train_test_split(df_main_new,test_size =0.3,random_state=2)

In [0]:
# you can use following method if you want to ignore categories with too low frequencies , 
# ignoring categories with low frequencies however will result in fewer columns without 
# affecting model performance too much .

# for col in cat_columns:
#     freqs=df_train[col].value_counts()
#     k=freqs.index[freqs>50000][:-1]
#     for cat in k:
#         name=str(col)+'_'+str(cat)
#         df_train[name]=(df_train[col]==cat).astype(int)
#     del df_train[col]
#     print(col)

In [126]:
who

Counter	 cat_columns	 col	 df_main_new	 df_test	 df_train	 go	 np	 num_columns
os	 pd	 plt	 pp	 py	 sns	 tls	 train_test_split	 unengaged_users
warnings

In [0]:
# del df_main_new

In [0]:
# df_train.drop(['transactions_currency','country'],axis=1,inplace=True)

In [0]:
# df_test.drop(['transactions_currency','country'],axis=1,inplace=True)

In [130]:
df_train.shape,df_test.shape

((12589184, 29), (5395365, 29))

In [131]:
Counter(df_train.dtypes.values)

Counter({dtype('int64'): 15, dtype('float64'): 1, dtype('O'): 13})

In [0]:
# from sklearn.ensemble import RandomForestClassifier

In [0]:
# rf = RandomForestClassifier(random_state=0,verbose=20)
# rf.fit(df_train.drop(['engagedORUnengaged'],axis=1), df_train['engagedORUnengaged'])
# features = df_train.drop(['engagedORUnengaged'],axis=1).columns.values
# print("----- Training Done -----")

In [0]:
# colormap = plt.cm.magma
# plt.figure(figsize=(16,12))
# plt.title('Pearson correlation of continuous features', y=1.05, size=15)
# sns.heatmap(train_float.corr(),linewidths=0.1,vmax=1.0, square=True, 
#             cmap=colormap, linecolor='white', annot=True)

In [0]:
# colormap = plt.cm.magma
# plt.figure(figsize=(16,12))
# plt.title('Pearson correlation of continuous features', y=1.05, size=15)
# sns.heatmap(train_int.corr(),linewidths=0.1,vmax=1.0, square=True, 
#             cmap=colormap, linecolor='white', annot=False)

In [0]:
# #Needs to Reduce the Dimension of the data to work 

# print('\nLoading data ...')
# # X = df_train.drop(['engagedORUnengaged'], axis=1).values
# # y = df_train['engagedORUnengaged'].values.astype(np.int8)
# target_names = np.unique(df_train['engagedORUnengaged'].values.astype(np.int8))
# print('\nThere are %d unique target valuess in this dataset:' % (len(target_names)), target_names)

In [137]:
df_train.columns

Index(['transaction_id', 'transactions_type', 'transactions_currency',
       'amount_usd', 'transactions_state', 'direction', 'user_id', 't_month',
       't_year', 't_day', 'birth_year', 'country', 'city',
       'user_settings_crypto_unlocked', 'plan',
       'attributes_notifications_marketing_email', 'num_contacts', 'u_month',
       'u_year', 'u_day', 'brand', 'reason', 'channel', 'status', 'n_month',
       'n_year', 'n_day', 'tran_count_each_user', 'engagedORUnengaged'],
      dtype='object')

In [0]:
# from sklearn.decomposition import PCA

In [0]:
# n_comp = 10
# # PCA
# print('\nRunning PCA ...')
# pca = PCA(n_components=n_comp)
# X_pca = pca.fit_transform(df_train.drop(['engagedORUnengaged'], axis=1).values)
# print('Explained variance: %.4f' % pca.explained_variance_ratio_.sum())

In [0]:
# print('Individual variance contributions:')
# for j in range(n_comp):
#     print(pca.explained_variance_ratio_[j])

In [0]:
# mf = mutual_info_classif(train_float.values,train.target.values,n_neighbors=3, random_state=17 )
# print(mf)

In [0]:
# from sklearn.ensemble import RandomForestClassifier
# rf = RandomForestClassifier(n_estimators=150, max_depth=8, min_samples_leaf=4, max_features=0.2, n_jobs=-1, random_state=0,verbose=20)
# rf.fit(df_main_new.drop(['engagedORUnengaged'],axis=1), df_main_new['engagedORUnengaged'])
# features = df_main_new.drop(['engagedORUnengaged'],axis=1).columns.values
# print("----- Training Done -----")

In [0]:
# x_train ,x_test ,y_train,y_test = train_test_split(df_main_new , test_size = 0.3,random_state = 2 )

# list(zip(df_train.shape , df_test.shape))

In [0]:
# x_train , y_train =df_train.drop('engagedORUnengaged',axis=1) ,df_train['engagedORUnengaged']

In [0]:
# x_test ,y_test = df_test.drop('engagedORUnengaged',axis =1) ,df_test['engagedORUnengaged']

In [0]:
# y_train.value_counts()

In [0]:
# smt = SMOTE()
# x_train, y_train = smt.fit_sample(x_train, y_train)

In [0]:
# np.bincount(y_train)

## **`Feature Engineering`**

In [149]:
df_train.reset_index(drop=True)

               transaction_id  ... engagedORUnengaged
0         transaction_1056526  ...                  0
1          transaction_965956  ...                  0
2          transaction_168962  ...                  0
3         transaction_1256161  ...                  0
4         transaction_1592690  ...                  0
...                       ...  ...                ...
12589179  transaction_2662627  ...                  0
12589180  transaction_1665865  ...                  0
12589181  transaction_2615714  ...                  0
12589182   transaction_921383  ...                  0
12589183   transaction_277604  ...                  0

[12589184 rows x 29 columns]

In [150]:
target =  df_train[['user_id','engagedORUnengaged']]

len(target)

12589184

In [151]:
c=['count','nunique']
n=['mean','max','min','sum','std']
agg_c={'transaction_id':c,'transactions_type':c,'transactions_currency':c,'transactions_state':c,'amount_usd':n,'transactions_state':c,\
       'direction':c,'t_month':c,'t_year':c,'t_day':c,\
       'birth_year':c,'country':c,'city':c,'user_settings_crypto_unlocked':c,'plan':c,'attributes_notifications_marketing_email':c,\
       'num_contacts':n,'u_month':c,'u_year':c,'u_day':c,'brand':c,'reason':c,'channel':c,\
       'status':c,'n_month':c,'n_year':c,'n_day':c ,'tran_count_each_user':n}
df_train=df_train.groupby(['user_id']).agg(agg_c)
df_train.head()

          transaction_id         transactions_type  ... tran_count_each_user
                   count nunique             count  ...                  min       sum  std
user_id                                             ...
user_0              2193     389              2193  ...                 3112   6824616  0.0
user_1               642     129               642  ...                  903    579726  0.0
user_10             4400    1051              4400  ...                 6318  27799200  0.0
user_100             369     131               369  ...                  532    196308  0.0
user_1000            500      39               500  ...                  702    351000  0.0

[5 rows x 63 columns]

In [152]:
df_train.columns=['R_' + '_'.join(col).strip() for col in df_train.columns.values]
df_train.reset_index(inplace=True)
df_train.head()

     user_id  ...  R_tran_count_each_user_std
0     user_0  ...                         0.0
1     user_1  ...                         0.0
2    user_10  ...                         0.0
3   user_100  ...                         0.0
4  user_1000  ...                         0.0

[5 rows x 64 columns]

In [153]:
df_train.sample(10)

          user_id  ...  R_tran_count_each_user_std
10408    user_257  ...                         0.0
12892   user_4875  ...                         0.0
1145   user_11083  ...                         0.0
4756   user_14613  ...                         0.0
1741   user_11657  ...                         0.0
1861   user_11772  ...                         0.0
3623   user_13498  ...                         0.0
10104   user_2289  ...                         0.0
8113   user_17870  ...                         0.0
3853   user_13716  ...                         0.0

[10 rows x 64 columns]

In [0]:
df =pd.merge(df_train,target,on='user_id',how='left')

In [157]:
df.head()

  user_id  ...  engagedORUnengaged
0  user_0  ...                   0
1  user_0  ...                   0
2  user_0  ...                   0
3  user_0  ...                   0
4  user_0  ...                   0

[5 rows x 65 columns]

In [0]:
df.isna().sum()

In [0]:
# df_train_with_target.isna().sum()